package com.liuwen.五大算法题.动态规划算法;

/**
 * ----------------------------------------------------------------------
 * [0,1]背包算法
 *
 * @author Create by liu wen at 2021.4.26 19:34
 * <p>
 * ----------------------------------------------------------------------
 */
public class BackPack {

    public static void main(String[] args) {
        // 背包的容量  物品的重量  物品的价值

        // 创建二维数组 这表示前i个物品能够装入容量为j的背包的最大价值

        // 保存装入背包的记录


        // 初始化

        // 放物品（想一想填表格的过程）


        // 打印二维数组


        // 给出哪些物品加入了背包



    }
}
